Revit 2026 API

# StairsRunActualTreadsNumber Property

---

The actual number of stairs treads in the stairs run.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int ActualTreadsNumber { get; }
```
```vb
Public ReadOnly Property ActualTreadsNumber As Integer
	Get
```
```cpp
public:
property int ActualTreadsNumber {
	int get ();
}
```
```fsharp
member ActualTreadsNumber : int with get
```

#### Property Value

Int32

This is a read-only value.

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace